Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИДОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыплатаЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ДвижениеДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Возврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/сабГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>сабГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСуммаКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсКонтрагента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Согласование1ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопПризнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДСтрокиБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Д_ИсточникиСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Д_ИсточникиСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийДвиженияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДвиженияДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БанковскаяВыписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаВНХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВНХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеОплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеПоступлений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияПоЭквайрингу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходныйКассовыйОрдер/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Модифицированность() Тогда
		сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);	
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура УУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование") ИЛИ 
		(ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаявкаНаФинансирование") И НЕ ДанныеЗаполнения.Свойство("ЭтоПКО")) Тогда
		// Заполнение шапки
		
		ЕстьСтруктура = Ложь;
		СуммаОстатка = 0;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаявкаНаФинансирование") 
			 И ЗначениеЗаполнено(ДанныеЗаполнения.ЗаявкаНаФинансирование) Тогда
			ЕстьСтруктура = Истина;
			СуммаОстатка = ДанныеЗаполнения.СуммаДокумента - ДанныеЗаполнения.СуммаОплачено;
			
			Если СуммаОстатка < 0 Тогда
				СуммаОстатка = 0;			
			КонецЕсли;
			
			ДанныеЗаполнения = ДанныеЗаполнения.ЗаявкаНаФинансирование;
			
		КонецЕсли;
		
		ЭтоДанныеРеестра = Ложь;
		Реестр = Неопределено;
		ДанныеЗаявки = ДанныеЗаполнения;
		
		Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("РеестрЗаявок") И ЗначениеЗаполнено(ДанныеЗаполнения.РеестрЗаявок)) 
			ИЛИ (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование")) Тогда //получаем данные из строки
			
			НайденныеСтрокиРеестра = ДанныеЗаполнения.РеестрЗаявок.ЗаявкаБезнал.НайтиСтроки(Новый Структура("ЗаявкаНаФинансирование", ДанныеЗаполнения.Ссылка));
			Если НайденныеСтрокиРеестра.Количество() Тогда
				Реестр = ДанныеЗаполнения.РеестрЗаявок; 
				ДанныеЗаполнения = НайденныеСтрокиРеестра[0];
				ЭтоДанныеРеестра = Истина;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ТипЗнч(ДанныеЗаполнения.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") Тогда // реестр без заявок
			
			НайденныеСтрокиРеестра = ДанныеЗаполнения.Заявка.ЗаявкаБезнал.НайтиСтроки(Новый Структура("УИДСтроки", ДанныеЗаполнения.УИДСтроки));

			Если НайденныеСтрокиРеестра.Количество() Тогда
				Реестр = ДанныеЗаполнения.Заявка;
				ДанныеЗаполнения = НайденныеСтрокиРеестра[0];
				ЭтоДанныеРеестра = Истина;
				ДанныеЗаявки = Новый Структура;
				ДанныеЗаявки.Вставить("Комментарий", Реестр.Комментарий);
				ДанныеЗаявки.Вставить("Ссылка", Реестр);
				ДанныеЗаявки.Вставить("ТипИсточника", Реестр.ТипИсточника);
				ДанныеЗаявки.Вставить("ВидОперации", ДанныеЗаполнения.ВидОперации);
				ДанныеЗаявки.Вставить("НазначениеПлатежаУчет", ДанныеЗаполнения.НазначениеПлатежа);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Дата, Номер, Проведен");
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
		
		Содержание = ДанныеЗаполнения.НазначениеПлатежа + " / " + ДанныеЗаявки.Комментарий;
		СуммаДокумента = ?(СуммаОстатка, СуммаОстатка, ?(ЭтоДанныеРеестра, ДанныеЗаполнения.СуммаДДС, ДанныеЗаполнения.Сумма));
		
		Субконто2 = ДанныеЗаполнения.Источник;
		Если ЗначениеЗаполнено(Субконто2) Тогда
			Счет = УЧ_Сервер.ВернутьСчетПоИсточнику(Субконто2);
			Валюта1 = Субконто2.ВалютаДенежныхСредств;
			Организация = Субконто2.Владелец;
			//Если Не ЗначениеЗаполнено(Предприятие) Тогда
			//	Предприятие = ПП_Сервер.ПолучитьПредприятие(Дата, Субконто2);
			//КонецЕсли;
			//Если Не ЗначениеЗаполнено(Предприятие) Тогда
			//	Предприятие = ДанныеЗаполнения.ЦФО;
			//КонецЕсли;
		КонецЕсли;
		ГУИДОснования = ?(ЭтоДанныеРеестра, ДанныеЗаполнения.УИДСтроки, Неопределено);
		ДокОснование = ДанныеЗаявки.Ссылка;
		Если ДанныеЗаявки.ТипИсточника = Перечисления.Д_ИсточникиСредств.Нал Тогда
			ВидОперации = Перечисления.ВидыОперацийДвиженияДС.КассовыйОрдер;
		ИначеЕсли ДанныеЗаявки.ТипИсточника = Перечисления.Д_ИсточникиСредств.Казна Тогда
			ВидОперации = Перечисления.ВидыОперацийДвиженияДС.Взаимозачет;
		Иначе	
			ВидОперации = Перечисления.ВидыОперацийДвиженияДС.БанковскаяВыписка;
		КонецЕсли;
		Если ВидОперации = Перечисления.ВидыОперацийДвиженияДС.Взаимозачет Тогда
			ПриходРасход = Перечисления.ВидыОперацийПлатежноеПоручение.ВозмещениеОплат;	
		Иначе	
			ПриходРасход = ДанныеЗаявки.ВидОперации;
		КонецЕсли;
		
		Если ЭтоДанныеРеестра Тогда
			ДанныеРасшифровки = Реестр.РасшифровкиСтрок.НайтиСтроки(Новый Структура("УИДСтрокиЗаявки", ДанныеЗаполнения.УИДСтроки));
			КоличествоСтрокРасшифровки = ДанныеРасшифровки.Количество();
			Если НЕ КоличествоСтрокРасшифровки Тогда
				Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаявкаНаФинансирование) Тогда
					НовыйДокШаблон = Документы.Д_ЗаявкаНаОплату.СоздатьДокумент();
					ДанныеРасшифровки = НовыйДокШаблон.РасшифровкиСтрок.Выгрузить();
					Если ДанныеЗаполнения.ЗаявкаНаФинансирование.РасшифровкаПлатежа Тогда
						Для каждого ТекСтрока Из ДанныеЗаполнения.ЗаявкаНаФинансирование.ТабличнаяЧасть Цикл
							НоваяСтрокаДока = ДанныеРасшифровки.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаДока, ТекСтрока);
							НоваяСтрокаДока.ЦФО = ТекСтрока.Предприятие;
							НоваяСтрокаДока.ВалютнаяСумма = ТекСтрока.ВалСумма;
							НоваяСтрокаДока.УИДСтрокиЗаявки = ДанныеЗаполнения.УИДСтроки;
						КонецЦикла; 
					КонецЕсли;
					КоличествоСтрокРасшифровки = ДанныеРасшифровки.Количество();
				КонецЕсли;
			КонецЕсли;
		Иначе	
			ДанныеРасшифровки = ДанныеЗаполнения.ТабличнаяЧасть;
			КоличествоСтрокРасшифровки = ?(ДанныеЗаполнения.РасшифровкаПлатежа, ДанныеЗаполнения.ТабличнаяЧасть.Количество(), 0);
		КонецЕсли;
		
		Для ТекИндексСтроки = 0 По МАКС(КоличествоСтрокРасшифровки, 1) - 1 Цикл
			Если КоличествоСтрокРасшифровки Тогда
				ТекСтрока = ДанныеРасшифровки[ТекИндексСтроки];
			Иначе
				ТекСтрока = ДанныеЗаполнения;			
			КонецЕсли;
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.СуммаПлатежа = ?(СуммаОстатка, СуммаОстатка, ?(ЭтоДанныеРеестра, ТекСтрока.СуммаДДС, ТекСтрока.Сумма));
			//НоваяСтрока.ФинСтатья = ТекСтрока.СтатьяДДС;
			//НоваяСтрока.ФинЦФО = ТекСтрока.ЦФО;
			//НоваяСтрока.ФинПодразделение = ТекСтрока.Подразделение;
			//НоваяСтрока.КорСчет = Неопределено;
			//НоваяСтрока.Содержание = ДанныеЗаявки.НазначениеПлатежаУчет;
			
			//Если ТипЗнч(ДанныеЗаявки.Ссылка) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование") Тогда
			//	Если КоличествоСтрокРасшифровки = 0 Тогда
			//		СтрокиБюджета = ДанныеЗаявки.Ссылка.СтрокиГрафикаБюджета.НайтиСтроки(Новый Структура("Использовать", Истина));
			//	Иначе	
			//		СтрокиБюджета =  ДанныеЗаявки.Ссылка.СтрокиГрафикаБюджета.НайтиСтроки(Новый Структура("УИДСтрокиРасшифровки, Использовать", ТекСтрока.УИДСтроки, Истина));
			//	КонецЕсли;
			//	Для каждого ТекСтрокаБюджета Из СтрокиБюджета Цикл
			//		НоваяСтрока.КлючАналитикиБюджета = Справочники.КлючиАналитикиБюджетов.НайтиПоРеквизиту("УИДСтроки", ТекСтрокаБюджета.УИДСтроки);
			//	КонецЦикла; 
			//КонецЕсли;
			
			//Если ВидОперации = Перечисления.ВидыОперацийДвиженияДС.Взаимозачет Тогда
			//	НоваяСтрока.КорСчет = ПланыСчетов.Учетный.НайтиПоКоду("79.01");
			//	НоваяСтрока.КорСубконто1 = ДанныеЗаполнения.Контрагент;
			//	НоваяСтрока.КорСубконто2 = ДанныеЗаполнения.Договор;
			//	
			//ИначеЕсли ПриходРасход = Перечисления.ВидыОперацийПлатежноеПоручение.ОплатаВНХ Тогда
			//	
			//Иначе
			//	
			//КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура УУ_ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		
		ТекДокОсн = ДокОснование;
		ТекУИД = ГУИДОснования;
		
		НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ТекДокОсн);
		НаборЗаписей.Прочитать();
		НомерСтрокиЗаявки = ТекУИД;
		МассивКУдалению = Новый Массив;
		Для каждого ТекСтрока Из НаборЗаписей Цикл
			Если ТекСтрока.УИДСтрокиДокумента = НомерСтрокиЗаявки Тогда
				МассивКУдалению.Добавить(ТекСтрока);	
			КонецЕсли;
		КонецЦикла;
		Для каждого ТекСтрокаУд Из МассивКУдалению Цикл
			НаборЗаписей.Удалить(ТекСтрокаУд);		
		КонецЦикла; 
		//НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		Если ЗначениеЗаполнено(ТекУИД) Тогда
			НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УИДСтрокиДокумента.Установить(ТекУИД);
			НаборЗаписей.Прочитать();
			МассивКУдалению = Новый Массив;
			Для каждого ТекСтрока Из НаборЗаписей Цикл
				МассивКУдалению.Добавить(ТекСтрока);	
			КонецЦикла;
			Для каждого ТекСтрокаУд Из МассивКУдалению Цикл
				НаборЗаписей.Удалить(ТекСтрокаУд);		
			КонецЦикла; 
			//НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры
